read_verilog verilog/*.v toplevel.v

synth_ice40 -noflatten -abc2 -blif sail_modified.blif

write_json sail_modified.json
