read_verilog verilog/*.v toplevel.v

synth_ice40 -noflatten -abc2 -blif sail.blif

write_json sail.json
